Updating the docs
